app/controllers/educators_controller.rb

INSERT INTO "educators" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @educator = Educator.new params.require(:educator).permit(:first_name, :last_name, :username, :email, :password, :password_digest)
    if @educator.save