app/controllers/pages_controller.rb

  def create  # create project
    @project = Project.new params.require(:project).permit(:title, :description, :content)
    @project.user_id = user_id # comes from ApplicationController

    if @project.save
---
INSERT INTO "projects" ("content", "created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", ""], ["created_at", "2015-07-13 16:25:21.880797"], ["description", "b"], ["title", "a"], ["updated_at", "2015-07-13 16:25:21.880797"]]

  def signup_post
    @user = User.new params.require(:user).permit(:first_name, :last_name, :username, :email, :password, :password_confirmation)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)

  def signin_post
    email = params[:session][:email]
    password = params[:session][:password]

    user = User.find_by(email: email)
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'bryanelidimas@gmail.com' LIMIT 1

  def my_projects
    @projects = Project.where(:user_id => user_id ).reverse
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."user_id" = 6 LIMIT 1